Documents/РегистрацияЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РегистрацияЗаказа</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Официант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтола</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Блюдо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АссортиментБлюд</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РегистрацияЗаказа/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаказКоличествоПриИзменении(Элемент)  
	
	ТекущиеДанныеТаблицы = Элементы.Заказ.ТекущиеДанные;
	_Расчеты.РассчитатьСумму(ТекущиеДанныеТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказЦенаПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.Заказ.ТекущиеДанные;
	_Расчеты.РассчитатьСумму(ТекущиеДанныеТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказБлюдоПриИзменении(Элемент) 
	
	ТекущиеДанныеТаблицы = Элементы.Заказ.ТекущиеДанные; 
	ТекущиеДанныеТаблицы.Цена = ПолучитьЦену(ТекущиеДанныеТаблицы.Блюдо);
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьЦену(Блюдо)
	
	НайтиБлюдо = Справочники.АссортиментБлюд.НайтиПоНаименованию(Блюдо, Истина);
	Возврат НайтиБлюдо.Цена;
КонецФункции
